Revit 2027 API
DisplayUnit Enumeration
Describes the type of Revit display unit, metric or imperial.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DisplayUnit
Public Enumeration DisplayUnit
public enum class DisplayUnit
type DisplayUnit
Members
Member name | Value | Description
IMPERIAL | 1
METRIC | 0
See Also
Reference
Autodesk.Revit.DB Namespace